IMAGE = ('jpg', 'png', 'bmp', 'ai', 'psd', 'ico',
         'jpeg', 'ps', 'svg', 'tif', 'tiff')
VIDEO = ('mp4', 'mov', 'avi', 'mkv', 'wmv', '3gp', '3g2', 'mpg',
         'mpeg', 'm4v', 'h264', 'flv', 'rm', 'swf', 'vob')
DOCUMENT = ('pdf', 'txt', 'doc', 'docx', 'rtf',
            'tex', 'wpd', 'odt', 'xlsx', 'pptx')
MUSIC = ('mp3', 'wav', 'ogg', 'flac', 'aif', 'mid',
         'midi', 'mpa', 'wma', 'wpl', 'cda', 'amr')
ARCHIVES = ('zip', 'gz', 'tar')

# archives = ('zip', 'rar', '7z', 'z', 'gz', 'rpm', 'arj', 'pkg', 'deb', 'tar')

MAP_CHARS = {'а': 'a', 'б': 'b', 'в': 'v', 'г': 'g', 'д': 'd', 'е': 'e', 'ё': 'e', 'ж': 'zh', 'з': 'z', 'и': 'i', 'й': 'y',
             'к': 'k', 'л': 'l', 'м': 'm', 'н': 'n', 'о': 'o', 'п': 'p', 'р': 'r', 'с': 's', 'т': 't', 'у': 'u', 'ф': 'f', 'х': 'h',
             'ц': 'ts', 'ч': 'ch', 'ш': 'sh', 'щ': 'sch', 'ъ': '', 'ы': 'y', 'ь': '', 'э': 'e', 'ю': 'yu', 'я': 'ya', 'і': 'i',  'є': 'e', 'ї': 'i', 'А': 'A',
             'Б': 'B', 'В': 'V', 'Г': 'G', 'Д': 'D', 'Е': 'E', 'Ё': 'E', 'Ж': 'Zh', 'З': 'Z', 'И': 'I', 'Й': 'Y', 'К': 'K', 'Л': 'L',
             'М': 'M', 'Н': 'N', 'О': 'O', 'П': 'P', 'Р': 'R', 'С': 'S', 'Т': 'T', 'У': 'U', 'Ф': 'F', 'Х': 'H', 'Ц': 'Ts', 'Ч': 'Ch',
             'Ш': 'Sh', 'Щ': 'Sch', 'Ъ': '', 'Ы': 'Y', 'Ь': '', 'Э': 'E', 'Ю': 'Yu', 'Я': 'Ya', 'І': 'I',  'Є': 'E',  'Ї': 'I'}
